tracker/app/controllers/coffees_controller.rb

SELECT "coffees".* FROM "coffees"
---
  def index
    @coffees = Coffee.all

INSERT INTO "coffees" ("blend_name", "origin", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["blend_name", "cowboy"], ["origin", "nc"], ["notes", "yummy"], ["created_at", "2018-05-31 13:51:31.875581"], ["updated_at", "2018-05-31 13:51:31.875581"]]
---
  def create
    @coffee = Coffee.new(coffee_params)

    if @coffee.save

DELETE FROM "coffees" WHERE "coffees"."id" = $1  [["id", 1]]
---
  def destroy
    @coffee.destroy

SELECT  "coffees".* FROM "coffees" WHERE "coffees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_coffee
      @coffee = Coffee.find(params[:id])