creature_tracker/app/controllers/api/v1/creatures_controller.rb

  def create
    @creature = Creature.new(creature_params)

    if @creature.save
---
INSERT INTO "creatures" ("common_name", "scientific_name", "notes", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["common_name", "moa"], ["scientific_name", "Dinornithidae"], ["notes", "extinct"], ["status", "unseen"], ["created_at", "2018-05-31 18:18:20.579085"], ["updated_at", "2018-05-31 18:18:20.579085"]]

  def destroy
    @creature.destroy
---
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 3]]

    def set_creature
      @creature = Creature.find(params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]