creature_tracker/app/controllers/api/v1/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @note = Note.find(params[:creature_id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @notes = Note.find(params[:creature_id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("content", "created_at", "updated_at", "creature_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "This is another comment that I will inevitably delete"], ["created_at", "2018-06-01 12:03:50.458935"], ["updated_at", "2018-06-01 12:03:50.458935"], ["creature_id", 1]]
---
    def create
        @creature = Creature.find(params[:creature_id])
        @note = @creature.notes.create(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
    def destroy
        @note = Note.find(params[:id])
        @note.destroy